app/controllers/users_controller.rb

   def create

    @user = User.new(user_params)    # Not the final implementation!
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Feb 2014 16:16:52 UTC +00:00], ["email", "udizohar84@gmail.com"], ["name", "udi zohar"], ["updated_at", Mon, 24 Feb 2014 16:16:52 UTC +00:00]]